Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-10_56/nocomp/64K/out_09_29-11_05_15.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=5409: Sun Sep 29 11:06:22 2024
  read: IOPS=5860, BW=22.9MiB/s (24.0MB/s)(1513MiB/66080msec)
    clat (usec): min=8, max=4481, avg=111.19, stdev=24.06
     lat (usec): min=8, max=4482, avg=111.20, stdev=24.06
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[   98], 10.00th=[   99], 20.00th=[  101],
     | 30.00th=[  103], 40.00th=[  105], 50.00th=[  108], 60.00th=[  110],
     | 70.00th=[  112], 80.00th=[  116], 90.00th=[  128], 95.00th=[  135],
     | 99.00th=[  194], 99.50th=[  221], 99.90th=[  343], 99.95th=[  392],
     | 99.99th=[  529]
   bw (  KiB/s): min= 8239, max=29560, per=100.00%, avg=23452.99, stdev=3596.54, samples=132
   iops        : min= 2059, max= 7390, avg=5863.24, stdev=899.16, samples=132
  lat (usec)   : 10=0.03%, 20=0.18%, 50=0.01%, 100=13.86%, 250=85.59%
  lat (usec)   : 500=0.33%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=35.14%, sys=6.20%, ctx=387452, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=1513MiB (1586MB), run=66080-66080msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  64K      local
 
iters: 2
output_path: ./latency_res/09_29-10_56/nocomp/64K