Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-10_56/nocomp/64K/out_09_29-11_06_24.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=5859: Sun Sep 29 11:07:31 2024
  read: IOPS=5869, BW=22.9MiB/s (24.0MB/s)(1513MiB/65969msec)
    clat (usec): min=8, max=742, avg=110.12, stdev=19.36
     lat (usec): min=8, max=742, avg=110.14, stdev=19.36
    clat percentiles (usec):
     |  1.00th=[   95],  5.00th=[   98], 10.00th=[   99], 20.00th=[  101],
     | 30.00th=[  103], 40.00th=[  105], 50.00th=[  108], 60.00th=[  109],
     | 70.00th=[  111], 80.00th=[  115], 90.00th=[  124], 95.00th=[  133],
     | 99.00th=[  192], 99.50th=[  231], 99.90th=[  334], 99.95th=[  371],
     | 99.99th=[  478]
   bw (  KiB/s): min= 8304, max=30032, per=100.00%, avg=23512.82, stdev=3693.13, samples=131
   iops        : min= 2076, max= 7508, avg=5878.20, stdev=923.29, samples=131
  lat (usec)   : 10=0.04%, 20=0.17%, 50=0.01%, 100=13.78%, 250=85.66%
  lat (usec)   : 500=0.35%, 750=0.01%
  cpu          : usr=35.70%, sys=6.18%, ctx=387462, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=1513MiB (1586MB), run=65969-65969msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  64K      local
 
iters: 2
output_path: ./latency_res/09_29-10_56/nocomp/64K